# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIdParameterValue..::..Value Property
ElementIdParameterValue Class See Also
---
The stored value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public ElementId Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ Value {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace